import pytest

from sentencex import segment

# ruff: noqa: E501
tests = [
    (
        "પણ બીજાનાં સ્વપ્નાં જોવા રહું તો મારાં સ્વપ્નાંમાંનો વખત જ ન રહે ને! અને આવાં સ્વપ્નાં તો હરકોઈ જોઈ શકે છે. દાખલા તરીકે આ સ્વપ્નું તમે જોઈ શકશો ને મને કહી શકશો, પણ મારાં સ્વપ્નાં તો મારા વિના બીજું કોઈ જોઈ શકવાનું નથી!",
        [
            "પણ બીજાનાં સ્વપ્નાં જોવા રહું તો મારાં સ્વપ્નાંમાંનો વખત જ ન રહે ને!",
            "અને આવાં સ્વપ્નાં તો હરકોઈ જોઈ શકે છે.",
            "દાખલા તરીકે આ સ્વપ્નું તમે જોઈ શકશો ને મને કહી શકશો, પણ મારાં સ્વપ્નાં તો મારા વિના બીજું કોઈ જોઈ શકવાનું નથી!",
        ],
    )
]


@pytest.mark.parametrize("text,expected_sents", tests)
def test_segment(text, expected_sents):
    assert list(segment("gu", text)) == expected_sents
